# 독일 로또는 {1, 2, ..., 49}에서 수 6개를 고른다.
# 로또 번호를 선택하는데 사용되는 가장 유명한 전략은 49가지 수 중 k(k>6)개의 수를 골라 집합 S를 만든 다음 그 수만 가지고 번호를 선택하는 것이다.
# 예를 들어, k=8, S={1,2,3,5,8,13,21,34}인 경우 이 집합 S에서 수를 고를 수 있는 경우의 수는 총 28가지이다. ([1,2,3,5,8,13], [1,2,3,5,8,21], [1,2,3,5,8,34], [1,2,3,5,13,21], ..., [3,5,8,13,21,34])
# 집합 S와 k가 주어졌을 때, 수를 고르는 모든 방법을 구하는 프로그램을 작성하시오.


def com(index, level):
    '''
    index: 현재 위치
    level: 현재 선택 개수
    '''
    if level == 6: # 6개 선택하면 출력
        print(*choose)
        return
        
    for i in range(index, len(s)):
        choose.append(s[i]) # 현재 숫자 선택
        com(i+1, level+1) # 다음 위치 탐색
        choose.pop() # 백트래킹 
        # 백트래킹 발생?
        # 1. 목표 조건 만족 (level = 6)
        # 2. 더 이상 탐색할 숫자 없음

while True:
    choose = []
    s = list(map(int, input().split())) 
    if (len(s) == 1) & (s[0] == 0): # 0 입력하면 종료
        break
    s = s[1:] 
    com(0,0) 
    print()