'''
<수열A가 주어졌을 때, 가장 긴 증가하는 부분 수열 길이 구하기>
ex. 수열 A = {10, 20, 10, 30, 20, 50} 인 경우 
-> 가장 긴 증가하는 부분 수열은 {10, 20, 30, 50}이고, 길이는 4
- 첫째 줄에 수열 A의 크기 N
- 둘째 줄에는 수열 A를 이루고 있는 Ai
'''
# n = int(input())  # 6
# arr = list(map(int, input().split()))  # 10 20 10 30 20 50

# def lis(n, arr):
#     result = [arr[0]]  # 첫번째 숫자는 무조건 포함
#     cnt = 1  # 길이

#     for i in range(1, n):  # 1~5
#         if arr[i-1] < arr[i]:
#             result.append(arr[i])
#             cnt += 1
#     return cnt

# print(lis(n, arr))  # 4
# 지금 구한건 연속된 증가
'''
10 20 10 30 20 50
10-30(x), 30-20(x) 끊김
'''
'''
i 0  1  2  3  4  5
a 10 20 10 30 20 50
dp = [1, 1, 1, 1, 1, 1]
     j   i
i=0 [0]<[0] x 
    => dp = [1, 1, 1, 1, 1, 1]
i=1 [0]<[1] o -> dp[0]+1([10 20] 뒤에 하나 더 붙어서 +1)=2 vs dp[1]=1 
    => dp = [1, 2, 1, 1, 1, 1]
i=2 [0]<[2] x 
    [1]<[2] x 
    => dp = [1, 2, 1, 1, 1, 1]
i=3 [0]<[3] o -> dp[0]+1=2 vs dp[3]=1 -> dp = [1, 2, 1, 2, 1, 1]
    [1]<[3] o -> dp[1]+1=3([10 20 30]) vs dp[3]=2 -> dp = [1, 2, 1, 3, 1, 1] new!
    [2]<[3] o -> dp[2]+1=2 vs dp[3]=2 -> dp = [1, 2, 1, 3, 1, 1]
    => dp = [1, 2, 1, 3, 1, 1]
i=4 [0]<[4] o -> dp[0]+1=2 vs dp[4]=1 -> dp = [1, 2, 1, 3, 2, 1]
    [1]<[4] x
    [2]<[4] o -> dp[2]+1=2 vs dp[4]=2 -> dp = [1, 2, 1, 3, 2, 1]
    [3]<[4] x
    => dp = [1, 2, 1, 3, 2, 1]
i=5 [0]<[5] o -> dp[0]+1=2 vs dp[5]=1 -> dp = [1, 2, 1, 3, 2, 2]
    [1]<[5] o -> dp[1]+1=3 vs dp[5]=2 -> dp = [1, 2, 1, 3, 2, 3]
    [2]<[5] o -> dp[2]+1=2 vs dp[5]=3 -> dp = [1, 2, 1, 3, 2, 3]
    [3]<[5] o -> dp[3]+1=4([10 20 30 50]) vs dp[5]=3 -> dp = [1, 2, 1, 3, 2, 4]
    [4]<[5] o -> dp[4]+1=3 vs dp[5]=4 -> dp = [1, 2, 1, 3, 2, 4]    
    => dp = [1, 2, 1, 3, 2, 4]  여기서 제일 큰 값
'''
n = int(input())  # 6
arr = list(map(int, input().split()))

def long(n, arr):
    # i에서 끝나는 수열 길이
    dp = [1] * n  # 자기 자신 포함 -> 1로 초기화

    for i in range(n):  # 0 1 2 3 4 5
        for j in range(i):  # 0 1 2 3 4
            if arr[j] < arr[i]:  # 먼저 돌아가는거를 작게
                dp[i] = max(dp[i], dp[j] + 1)  # arr[j]에 arr[i] 추가할 수 있으니까 +1
    return max(dp)  # 제일 큰 값

print(long(n, arr)) 